<template>
<div class="space">
  <p>欢迎您使用金医网软件及服务。</p>
  <p>为使用金医网软件平台及服务（以下简称“本平台”或“平台”），您应当阅读并遵守《金医网平台许可及服务协议》（以下简称“本协议”），请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款。
    除非您已阅读并接受本协议所有条款，否则您无权下载、安装或使用本平台及相关服务。您的下载、安装、使用、登录等行为即视为您已阅读并同意上述协议的约束。
    如果您未满18周岁，请在法定监护人的陪同下阅读本协议及其他上述协议，并特别注意未成年人使用条款。</p>

  <p class="title">一、【协议的范围】</p>
  <p>1.1 协议适用主体范围</p>
  <p>本协议是您与金医网关于您下载、安装、使用、复制本软件，以及使用金医网相关服务所订立的协议。</p>

  <p>1.2协议关系及冲突条款</p>
  <p>本协议被视为《金医网服务协议》（链接地址：http://www.金医网.top/xieyi.html，若链接地址变更的，则以变更后的链接地址所对应的内容为准；）
    金医网保留在中华人民共和国大陆地区施行之法律允许的范围内独自决定拒绝服务、关闭用户账号、清除或编辑内容或取消服务的权利。</p>

  <p class="title">二、【软件的获取、安装、卸载、更新】</p>

  <p>2.1 您可以直接从金医网的网站上获取本软件，也可以从得到金医网授权的第三方获取。</p>

  <p>2.2 如果您从未经金医网授权的第三方获取本软件或与本软件名称相同的安装程序，    金医网无法保证该软件能够正常使用，并对因此给您造成的损失不予负责。</p>

  <p>2.3 金医网可能为不同的需求开发了不同的软件版本，您应当根据实际情况选择下载合适的版本进行安装。</p>

  <p>2.4 下载安装程序后，您需要按照该程序提示的步骤正确安装。</p>
  <p>2.5 为提供更加优质、安全的服务，在本软件安装时金医网可能推荐您安装其他软件，您可以选择安装或不安装。</p>
  <p>2.6 如果您不再需要使用本软件或者需要安装新版软件，可以自行卸载。如果您愿意帮助金医网改进服务，请告知卸载的原因。</p>
  <p>2.7 为了改善用户体验、完善服务内容，金医网将不断努力开发新的服务，并为您不时提供软件更新（这些更新可能会采取软件替换、修改、功能强化、版本升级等形式）。</p>
  <p>2.8 为了保证本软件及服务的安全性和功能的一致性，金医网有权不经向您特别通知而对软件进行更新，或者对软件的部分功能效果进行改变或限制。</p>
  <p>2.9 本软件新版本发布后，旧版本的软件可能无法使用。金医网不保证旧版本软件继续可用及相应的客户服务，请您随时核对并下载最新版本。</p>

  <p class="title">三、【您的帐号、密码和安全性】</p>

  <p>3.1您一旦注册成功，成为本平台的合法用户，将得到一个您的帐号和密码。您的帐号和密码由您负责保管。您都要对任何以您帐号进行的所有活动和事件负全责，且您有权随时更改您的密码。若发现任何非法使用您的帐号或存在安全漏洞的情况，请立即通知本平台。因黑客行为或您的保管疏忽等情况导致帐号、密码遭他人非法使用，平台不承担责任。</p>

  <p>3.2 您在进行注册过程中，您的用户名注册与使用应符合网络道德规范，遵守中华人民共和国的相关法律法规。您的用户名和昵称中不能含有威胁、淫秽、谩骂、非法、侵害他人正当权益等有争议性的文字。您在平台上的言论不得违法、不得违反公序良俗、不得使用攻击性语言恶意中伤他人，或作出虚假性陈述。您保证您在平台上提供的信息的真实性、合法性和有效性。您单独承担在平台上发布内容的一切相关责任。</p>

  <p class="title">四、【关于本服务】</p>

  <p>4.1服务内容</p>
  <p>本平台致力于为用户提供健康咨询、网上预约分诊、住院预约、手术预约、就诊陪同、和检查检验结果查询等服务，如果用户按照本平台规则访问并按照要求提供本人和/或就诊者身份信息及病情，即可享受相关服务。</p>

  <p>4.2关于服务申请</p>
  <p>利用本平台预约服务时，用户有责任按照要求填写预约申请(包括咨询者者的基本资料、疾病资料等信息)，所有信息必须准确、真实、有效，我们将按照现有法律法规的要求对用户的信息予以保护。若我们发现用户提供虚假或者不实信息，本平台有权立即终止向用户提供所有服务，并有权要求用户赔偿因提供虚假信息给本平台带来的损失。</p>

  <p>各类预约申请成功以本平台的站内消息与站外手机短信通知为准。因运营商短信通道故障或用户个人原因导致的发送不成功、延迟发送、延迟查阅等，本平台不负责任。</p>

  <p>为杜绝非法操作倒卖预约资源，本平台提醒用户就诊时务必携带就诊者本人的有效身份证件，否则由于就诊者真实性问题导致的预约失败的后果由用户自负。</p>

  <p>鉴于临床工作的特殊性，您预约的医生如遇到公众卫生事件、紧急抢救、急诊、临时停诊、减号/限号等特殊事件时，有可能延后甚至取消门诊，本平台若能获悉，会在第一时间通知用户。医生出诊时间以医院当日公布出诊日期为准。用户明确知悉并同意，由于门诊延误可能导致的病情延误及产生的交通、餐饮、住宿等费用问题。本平台、医生、医院均不承担任何责任。</p>

  <p>若就诊者无法按照预约时间就诊，应在预约日期的合理时间（此时间如与网上公布的医院规定相冲突，以医院规定为准）之前取消预约，否则未按约就诊将一律按照用户违约处理，并由用户自行承担因取消预约所产生的各种费用。</p>

  <p>医院收取的挂号费、特需专家的挂号费用、检查费、治疗费等费用需要用户另行支付。</p>

  <p class="title">五、【通过本平台搜索/检索到的信息】</p>

  <p>5.1本平台提供的健康咨询、医疗资源信息有部分由第三方提供，用户通过本平台搜索到的任何信息，仅供用户参考；</p>

  <p>5.2作为信息服务技术平台，因医院、医生的执业信息等数据有变动而未能及时与平台进行联系进行更新的，请以各大医院、医生的实际专业服务内容和执业情况为准，若因此而导致用户损失的，本平台不承担责任。</p>

  <p class="title">六、【关于用户发表的言论和信息】</p>

  <p>6.1用户在本平台上发表的言论和信息，包括但不限于用户对自己就诊评价的分享、对医生的点评、对医院的点评等，不能含有威胁、淫秽、谩骂、非法、侵害他人正当权益等有争议性的文字，属于用户个人意见的表达，并不代表本平台的立场和态度，也不代表本平台同意其观点或证明其所发表内容的真实性，请谨慎参考。</p>
  　
  <p> 6.2用户是否采信其它用户发表的言论和信息，或基于其它用户发表的言论和信息进行了某些行为，纯属该用户个人的意愿与选择，本平台提供方不负任何责任。</p>

  <p>本免责条款中如有任何约定与中华人民共和国法律相抵触，则这条约定将完全按法律规定重新解释，而其它条款依旧具有法律效力。我们保留随时更改上述免责及其他条款的权利。以任何方式登录本平台或直接、间接使用本平台资料者，视为自愿接受本平台免责条款的约束。</p>

  <p class="title">七、【责任限制及不承诺担保】</p>

  <p>7.1用户同意在自行承担风险的情况下，按平台的现状使用相关服务。</p>
  <p>金医网特此申明：对平台之使用不提供任何保证（包含但不限于商业担保和特殊目的的适用性担保），亦不对用户因服务暂停或终止而遭受的任何直接或间接损失承担责任。金医网不保证用户一定能够获得服务，金医网有权随时暂停或终止平台的全部或部分服务。</p>

  <p>用户理解平台中可能包含由第三方提供的服务，金医网只是为了用户的便利而提供相关的功能模块。用户使用第三方提供的服务，需与第三方另行达成服务协议，支付相应的费用并承担可能的风险。金医网对第三方所提供的服务不承担任何形式的担保。</p>

  <p>平台致力于提供正确、完整的健康和医疗资源信息，但不保证信息的真实性、准确性和完整性，且不对因信息的不正确或遗漏导致的任何损失承担责任。</p>

  <p>平台因受合作资源及其他不可控外部因素限制，金医网不保证用户所提预约请求一定能够成功。</p>

  <p>平台中医生向用户提供的任何反馈、意见或建议均代表医生的个人行为，且仅是依据用户描述提供的建议性咨询回复内容，不能作为诊断、用药及医疗的依据，是否采用是用户的个人行为，金医网不承担其言行导致的后果承担任何责任。</p>

  <p>平台提供的健康咨询与个人病例档案，不能替代医院的临床检查、检验、诊断</p>

  <p>平台拒绝登载并回复健康相关之外的咨询问题，包括但不限于以下问题：</p>

  <p>非医疗健康类问题；</p>

  <p>胎儿性别鉴定问题；</p>

  <p>涉嫌侵犯第三方隐私权或名誉权的问题；</p>

  <p>其他涉嫌违法违规或违背社会伦理道德内容的问题；</p>

  <p class="title">八、【对您信息的存储和限制】</p>
  <p>8.1平台不对您所发布信息的删除或储存失败负责。平台积极采用数据备份加密等措施保障您数据的安全，但不对由于因意外因素导致的数据损失和泄漏负责。平台有权审查和监督您的行为是否符合本协议、免责条款的要求，如果您违背了本协议和免责条款的规定，则平台有权中断您的服务。</p>

  <p>8.2 在不透露单个用户隐私资料的前提下，本平台有权对整个用户数据库进行分析并对用户账户名、真实姓名、身份证明、个人就医情况、通讯地址、联系电话、电子邮件等数据库信息进行合理的校正修改与技术应用。</p>

  <p class="title">九、【用户信息收集及保护】</p>

  <p>9.1 金医网尊重并保护用户的隐私权，用户注册的账户名、真实姓名、身份证明、个人就医情况、通讯地址、联系电话、电子邮件等个人资料，非经用户许可的不会主动地泄露给第三方。</p>

  <p>9.2您同意，金医网有权使用您的注册信息、用户名、密码等信息，登陆进入您的注册账户，进行证据保全，包括但不限于公证、见证、协助司法机关进行调查取证等。</p>
  <p>9.3 你同意，本平台拥有通过站内消息，电子邮件，短信，电话或声明等形式，向在本平台注册用户发送包括但不限于病情回访、提醒告知、饮食注意事项等信息。如你不希望接收上述信息，可退订取消。</p>
  <p>9.4用户在使用过程中应当遵守法律法规中关于隐私权的保护，不得自行(且不得允许任何第三方)使用本平台医生追踪或收集互联网用户的个人身份信息，也不得自行(且不得允许任何第三方)将从用户(或该第三方的网站)收集的任何数据与从任何来源获得的任何个人身份信息相联系。用户应制定并遵守合法且适当的隐私权政策。</p>


  <p class="title">十、【权利限制】</p>
  <p>用户不得自行或允许第三方：</p>
  <p>10.1以任何方式创作金医网 App软件或相关文档的衍生作品；</p>

  <p>10.2将金医网的产品和服务转让或再许可给他人；</p>

  <p>10.3对金医网进行反向工程、反向编译和反向汇编；</p>

  <p>10.4修改或拆分金医网的代码或者任何功能；</p>

  <p>10.5使用、公布、传输或采用干扰或试图干扰金医网服务或软件的运行的任何设备、软件或例程；</p>

  <p>10.6侵犯用户的隐私权及任何第三方的合法权益；</p>

  <p>10.7在金医网授权范围外使用金医网的数据、文档和报告。</p>


  <p class="title">十一、【不可抗力】</p>
  <p>除中华人民共和国法律规定不可抗力情形外，以下也属于不可抗力:</p>
  <p>11.1 任何公共的互联网骨干网、网络或者是服务器停运</p>

  <p>11.2 用户的设备系统</p>

  <p>11.3 已经预定的维护</p>

  <p>11.4 用户的服务器所在地区的互联网服务中断</p>

  <p>11.5 黑客攻击</p>


  <p class="title">十二、【其他】</p>
  <p>12.1 您使用本软件即视为您已阅读并同意受本协议的约束。</p>
  <p>金医网有权在必要时修改本协议条款。您可以在本软件的最新版本中查阅相关协议条款。本协议条款变更后，如果您继续使用本软件，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当停止使用本软件。</p>
  <p>12.2 本协议签订地为中华人民共和国广东省深圳市福田区。</p>
  <p>12.3 本协议的成立、生效、履行、解释及纠纷解决，适用于用户所在地，国家地区法律（不包括冲突法）。</p>
  <p>12.4 若您和金医网之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。</p>
  <p>12.5 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。</p>
  <p>12.6 本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。</p>


  <p>深圳生命量医疗科技有限公司</p>
</div>
</template>

<script>
    export default {
        name: '',
        data () {
            return {}
        },
        computed: {},
        watch: {},
        mounted () {
          let _this=this
          this.$store.commit('common/changeHeaderConf', {//设置当前头部信息
            isshow:true,//是否显示头部
            isBack: true,  // 是否显示返回
            handleback:_this.handleback,
            isShare: false, // 是否显示分享
            sharecontent:{},//分享的内容{title:'',subtitle:'',abstract:'',imgurl:''}
            isSkip: false,//是否显示跳过
            skipto: '',//点跳过后到哪个路由页面
            title: '用户协议' // 标题
          });
        },
        beforeRouteEnter(to, from, next){
            next ()
        },
        methods: {
          handleback(){
            //alert("监听到页面后退按钮");//根据自己的需求实现自己的功能
            if ('wx' == window.Browser_Environment_Oklife) {
              if (wx) {
                wx.ready(function () {
                  wx.closeWindow()
                })
              } else if (WeixinJSBridge) {
                WeixinJSBridge.call('closeWindow')
              }
            } else if ('app' == window.Browser_Environment_Oklife) {
              let jump = {//返回上层原生页面
                'nativeType': 'back'
              }
              let Success = () => {}
              let error = () => {}
              cordova.plugins.oklife.skipNative(Success, error, jump)//调用原生插件跳入原生快速咨询页面
            }
          },
        },
        components: {}
    }
</script>

<style lang="scss" scoped>
  @import "../../../static/css/base/min.scss";
  .space{
    /*margin-top: px2rem(88);*/
    padding: px2rem(30);
    box-sizing: border-box;
  }

  .title {
    text-indent: 0em;
    font-weight: 600;
  }
  p{
    text-indent: 2em;
    font-size:px2rem(30);
    margin-top: px2rem(10);
    color:#333333;
    &:last-child{
    float: right;
     }
  }
</style>
